# Project 3 Notes

In [4]:
import datadotworld as dw

## Baseball DB

- AB = at bats
- H = hits
- avergae = H/AB
-

In [5]:
results = dw.query('byuidss/cse-250-baseball-database', 
'''
SELECT *
FROM batting
WHERE playerid = "aberal01" AND yearid = 1957
''')
results.dataframe

,playerid,yearid,stint,teamid,lgid,g,ab,r,h,2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
0,aberal01,1957,1,DET,AL,28,8,0,1,0,...,1,0,0,1,4,0,0,0,0,0
1,aberal01,1957,2,KC1,AL,3,1,0,1,0,...,0,0,0,0,0,0,0,0,0,0

In [6]:
q1 = dw.query('byuidss/cse-250-baseball-database', 
'''
SELECT salaries.playerid, salaries.salary, salaries.teamid, salaries.yearid, schools.schoolid 
FROM salaries, schools 
WHERE schools.schoolid = "idbyuid"
''')
print(q1.dataframe)

        playerid   salary teamid  yearid schoolid
0      barkele01   870000    ATL    1985  idbyuid
1      bedrost01   550000    ATL    1985  idbyuid
2      benedbr01   545000    ATL    1985  idbyuid
3       campri01   633333    ATL    1985  idbyuid
4      ceronri01   625000    ATL    1985  idbyuid
...          ...      ...    ...     ...      ...
26423  peralda01   529600    ARI    2016  idbyuid
26424  polloaj01  3500000    ARI    2016  idbyuid
26425    rayro02   521000    ARI    2016  idbyuid
26426  segurje01  2600000    ARI    2016  idbyuid
26427  tomasya01  7500000    ARI    2016  idbyuid

[26428 rows x 5 columns]

## SQL Notes

In [ ]:
SELECT playerid, salary
FROM salaries
  JOIN -- <table name>
  ON -- <columns to join>
WHERE -- <filter condition>
GROUP BY playerid
ORDER BY -- <how the output is returned in sequence>
LIMIT -- <number of rows to return>

In [ ]:
CREATE TABLE Persons (
    PersonID int,
    LastName varchar(255),
    FirstName varchar(255),
    Address varchar(255),
    City varchar(255)
);

In [ ]:
SELECT *
INTO newtable [IN externaldb]
FROM oldtable
WHERE condition;

In [ ]:
SELECT salaries.playerid,
       salaries.salary,
       salaries.teamid,
       salaries.yearid,
       schools.schoolid 
INTO byui_players [IN externaldb]
FROM oldtable
WHERE condition;

In [ ]:
SELECT salaries.playerid,
       salaries.salary,
       salaries.teamid,
       salaries.yearid,
       schools.schoolid 
FROM salaries, schools
WHERE (schools.schoolid = "idbyuid");

In [ ]:
Select salaries.playerid, salaries.salary, salaries.teamid, salaries.yearid, schools.schoolid into byui_players from salaries WHERE (schools.schoolid = "idbyuid");